# IfcTypeGuid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcTypeGuid Property
ParameterTypeId Class See Also
---
"Type IfcGUID"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcTypeGuid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcTypeGuid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcTypeGuid {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace